vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.EFM32PG1B_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4.9" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>https://www.keil.com/pack/</url>
  <name>EFM32PG1B_DFP</name>
  <description>Silicon Labs EFM32 Pearl Gecko Series Device Support</description>

  <releases>
    <release version="1.2.0" date="2018-01-15" deprecated="2018-01-15" replacement="SiliconLabs.EFM32PG1B_DFP">
      The maintenance of this pack will be discontinued and SiliconLabs is providing the new pack SiliconLabs.EFM32PG1B_DFP.
    </release>
    <release version="1.1.0" date="2017-06-22">
      Updated device support files to V5.1.3.
      Updated Flash Algorithms to 5.2.0.
      Updated SVD files to V5.2.1.
      Updated emlib, emdrv to V5.1.3.
      Updated documentation.
      Added new devices.
    </release>
    <release version="1.0.0" date="2016-04-22">
      Initial Release version of EFM32PG1B Device Family Pack.
      Device support files to V4.2.0.
      emlib, emdrv to V4.2.0.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>Silicon Labs</keyword>
    <keyword>EFM32PG1B</keyword>
    <keyword>EFM32</keyword>
  </keywords>

  <devices>
    <family Dfamily="EFM32PG1B Series" Dvendor="Silicon Labs:21">
      <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
      <processor Dclock="38400000"/>

      <environment name="uv">
        <CMisc>--C99</CMisc>
      </environment>

      <book name="Documents/DUI0553A_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
      <book name="Documents/EFM32PG1-ReferenceManual.pdf" title="EFM32PG1 Reference Manual"/>
      <book name="Documents/efm32pg1-datasheet.pdf"       title="EFM32PG1 Data Sheet"/>

      <description>
Silicon Labs' Pearl Gecko 32-bit microcontroller family features a powerful 32-bit ARM® Cortex®-M4 and a wide selection of peripherals, including a unique cryptographic hardware engine supporting AES, ECC, and SHA.
These features, combined with ultra-low current active mode and short wake-up time from energy-saving modes, make Pearl Gecko microcontrollers well suited for any battery-powered application, as well as other systems requiring high performance and low-energy consumption.
      </description>

      <!-- ************************  Subfamily 'EFM32PG1B200'  **************************** -->
      <subFamily DsubFamily="EFM32PG1B200">

        <!-- *************************  Device 'EFM32PG1B200F256GM48'  ***************************** -->
        <device Dname="EFM32PG1B200F256GM48">
          <compile header="Device/EFM32PG1B/Include/em_device.h"  define="EFM32PG1B200F256GM48"/>
          <debug svd="SVD/EFM32PG1B/EFM32PG1B200F256GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
  
        <!-- *************************  Device 'EFM32PG1B200F256IM48'  ***************************** -->
        <device Dname="EFM32PG1B200F256IM48">
          <compile header="Device/EFM32PG1B/Include/em_device.h"  define="EFM32PG1B200F256IM48"/>
          <debug svd="SVD/EFM32PG1B/EFM32PG1B200F256IM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
  
        <!-- *************************  Device 'EFM32PG1B200F128GM48'  ***************************** -->
        <device Dname="EFM32PG1B200F128GM48">
          <compile header="Device/EFM32PG1B/Include/em_device.h"  define="EFM32PG1B200F128GM48"/>
          <debug svd="SVD/EFM32PG1B/EFM32PG1B200F128GM48.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
  
        <!-- *************************  Device 'EFM32PG1B200F256GM32'  ***************************** -->
        <device Dname="EFM32PG1B200F256GM32">
          <compile header="Device/EFM32PG1B/Include/em_device.h"  define="EFM32PG1B200F256GM32"/>
          <debug svd="SVD/EFM32PG1B/EFM32PG1B200F256GM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
  
        <!-- *************************  Device 'EFM32PG1B200F256IM32'  ***************************** -->
        <device Dname="EFM32PG1B200F256IM32">
          <compile header="Device/EFM32PG1B/Include/em_device.h"  define="EFM32PG1B200F256IM32"/>
          <debug svd="SVD/EFM32PG1B/EFM32PG1B200F256IM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
  
        <!-- *************************  Device 'EFM32PG1B200F128GM32'  ***************************** -->
        <device Dname="EFM32PG1B200F128GM32">
          <compile header="Device/EFM32PG1B/Include/em_device.h"  define="EFM32PG1B200F128GM32"/>
          <debug svd="SVD/EFM32PG1B/EFM32PG1B200F128GM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'EFM32PG1B100'  **************************** -->
      <subFamily DsubFamily="EFM32PG1B100">
  
