vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.EFM32PG1B_DFP.pdsc
        <!-- *************************  Device 'EFM32PG1B100F256GM32'  ***************************** -->
        <device Dname="EFM32PG1B100F256GM32">
          <compile header="Device/EFM32PG1B/Include/em_device.h"  define="EFM32PG1B100F256GM32"/>
          <debug svd="SVD/EFM32PG1B/EFM32PG1B100F256GM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
  
        <!-- *************************  Device 'EFM32PG1B100F256IM32'  ***************************** -->
        <device Dname="EFM32PG1B100F256IM32">
          <compile header="Device/EFM32PG1B/Include/em_device.h"  define="EFM32PG1B100F256IM32"/>
          <debug svd="SVD/EFM32PG1B/EFM32PG1B100F256IM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
  
        <!-- *************************  Device 'EFM32PG1B100F128GM32'  ***************************** -->
        <device Dname="EFM32PG1B100F128GM32">
          <compile header="Device/EFM32PG1B/Include/em_device.h"  define="EFM32PG1B100F128GM32"/>
          <debug svd="SVD/EFM32PG1B/EFM32PG1B100F128GM32.svd"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00008000" init   ="0"   default="1"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00020000" startup="1"   default="1"/>
          <algorithm name="Flash/GECKOP2.FLM" start="0x00000000" size="0x00020000"               default="1" RAMstart="0x20000000" RAMsize="0x8000"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFM32PG1B">
      <description>Silicon Labs EFM32PG1B devices</description>
      <require Dvendor="Silicon Labs:21" Dname="EFM32PG1B*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="EFM32PG1B CMSIS">
      <description>Silicon Labs EFM32PG1B devices, CMSIS Core</description>
      <require condition="EFM32PG1B"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS + Compiler Conditions -->
    <condition id="EFM32PG1B CMSIS GCC">
      <description>Silicon Labs EFM32PG1B devices, CMSIS Core, GCC compiler</description>
      <require condition="EFM32PG1B CMSIS"/>
      <require condition="Compiler GCC"/>
    </condition>

    <!-- emlib Conditions -->
    <condition id="emlib Framework">
      <description>Silicon Labs emlib Framework</description>
      <require condition="EFM32PG1B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
    </condition>
    <condition id="emlib SYSTEM">
      <description>Silicon Labs emlib with SYSTEM</description>
      <require condition="EFM32PG1B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
    <condition id="emlib EMU">
      <description>Silicon Labs emlib with EMU</description>
      <require condition="EFM32PG1B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="EMU"/>
    </condition>
    <condition id="emlib CMU">
      <description>Silicon Labs emlib with CMU</description>
      <require condition="EFM32PG1B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
    </condition>
    <condition id="emlib CMU SYSTEM">
      <description>Silicon Labs emlib with CMU, SYSTEM</description>
      <require condition="EFM32PG1B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
    <condition id="emlib CMU SYSTEM CORE">
      <description>Silicon Labs emlib with CMU, SYSTEM, CORE</description>
      <require condition="EFM32PG1B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CORE"/>
    </condition>
    <condition id="emlib CMU GPIO">
      <description>Silicon Labs emlib with CMU, GPIO</description>
      <require condition="EFM32PG1B"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
    </condition>
  </conditions>

  <taxonomy>
    <description Cclass="Device"        Cgroup="emlib"   doc="emdoc/efm32pg1/html/group__emlib.html" >Silicon Labs Low-level peripheral library</description>
  </taxonomy>

  <components>
    <!-- Startup -->
    <component Cclass="Device" Cgroup="Startup"                      Cversion="5.1.3" condition="EFM32PG1B CMSIS">
      <description>System Startup for Silicon Labs EFM32PG1 device series</description>
      <files>
        <file category="doc"          name="emdoc/efm32pg1/html/index.html"/>

        <file category="include"      name="Device/EFM32PG1B/Include/"/>
        <file category="sourceAsm"    name="Device/EFM32PG1B/Source/ARM/startup_efm32pg1b.s" attr="config" version="5.1.3" condition="Compiler ARMCC"/>
        <file category="sourceC"      name="Device/EFM32PG1B/Source/GCC/startup_efm32pg1b.S" attr="config" version="5.1.3" condition="Compiler GCC"  />
        <file category="linkerScript" name="Device/EFM32PG1B/Source/GCC/efm32pg1b.ld"        attr="config" version="5.1.3" condition="Compiler GCC"/>
        <file category="sourceC"      name="Device/EFM32PG1B/Source/system_efm32pg1b.c"      attr="config" version="5.1.3"/>
        <!-- device configuration required by drivers at the moment -->
        <!--file category="header"       name="RTE_Driver/Config/RTE_Device.h"            attr="config" version="2.0.2"/-->
      </files>
    </component>
